#+title:     Ectorepo: OASIS Open
#+author:    David Conner
#+email:     noreply@te.xel.io
#+PROPERTY: header-args+ :comments none

OASIS is a great source of information on domain modeling and ontology.
Sometimes there are diagrams and pictures.

When using =repo init -u $url -m $manifest= instead of the git submodule to
checkout, the filepaths for =<include name=mnfst.xml/>= are relative to the root
repository.

#+begin_src xml :tangle default.xml
<manifest>
  <include name="_remotes.xml"/>
  <default remote="github" sync-j="8" revision="refs/heads/master"/>
  <include name="oasis-open/oasis.xml"/>
</manifest>
#+end_src

Check rates:

#+begin_src emacs-lisp :results value code :exports code
(ghub-graphql-rate-limit)
#+end_src

#+RESULTS:
#+begin_src emacs-lisp
((limit . 5000) (cost . 1) (remaining . 5000) (resetAt . "2025-02-21T04:38:22Z"))
#+end_src

To avoid confirmations

#+begin_src emacs-lisp
(setq-local org-confirm-babel-evaluate nil)
#+end_src

* Setup

#+name: nrepos
#+begin_src emacs-lisp
100
#+end_src

#+RESULTS: nrepos
: 100

#+begin_src restclient
curl -L \
  -X POST \
  -H "Accept: application/vnd.github+json" \
  -H "Authorization: Bearer <YOUR-TOKEN>" \
  -H "X-GitHub-Api-Version: 2022-11-28" \
  https://api.github.com/repos/OWNER/REPO/dispatches \
  -d '{"event_type":"on-demand-test","client_payload":{"unit":false,"integration":true}}'
#+end_src

* Oasis Open

Clone bundle sizes

#+name: oasisMetadata
#+begin_src restclient :jq "map([.owner.login, .name, .size, .default_branch])[] | @csv" :results table :jq-args "--raw-output"
:gh-graphql-url = https://api.github.com/graphql
:gh-url-base = https://api.github.com
:gh-org = oasis-open
:gh-url-path = orgs/:gh-org/repos
:gh-token := (auth-source-pass-get 'secret "api.github.com/dcunited001^ghub")

:headers = <<
Accept: application/vnd.github+json
Authorization: Bearer :gh-token
X-GitHub-Api-Version: 2022-11-28
User-Agent: Emacs
#

GET :gh-url-base/:gh-url-path
:headers
#+end_src

#+RESULTS: oasisMetadata
| oasis-open | dita-rng-converter            | 11596 | master |
| oasis-open | dita-lightweight              |   580 | spec   |
| oasis-open | legaldocml-akomantoso         |   359 | master |
| oasis-open | tosca-community-contributions |   715 | master |
| oasis-open | cti-stix2-json-schemas        |   519 | master |
| oasis-open | cti-cybox3-json-schemas       |     7 | master |
| oasis-open | cti-documentation             | 12953 | main   |
| oasis-open | cti-pattern-validator         |   460 | master |
| oasis-open | cti-marking-prototype         |    26 | master |
| oasis-open | cti-stix-visualization        |  1674 | master |
| oasis-open | cti-stix-validator            |  1328 | master |
| oasis-open | cti-pattern-matcher           |   563 | master |
| oasis-open | cti-stix-elevator             | 14071 | master |
| oasis-open | dita-stylesheets              |   628 | master |
| oasis-open | cti-python-stix2              |  3433 | master |
| oasis-open | cti-taxii-client              |   326 | master |
| oasis-open | cti-taxii-server              |   881 | master |
| oasis-open | openc2-jadn-software          |  4648 | master |
| oasis-open | openc2-ocas                   |  1260 | master |
| oasis-open | openc2-orchid                 |     9 | master |
| oasis-open | openc2-yuuki                  |   531 | master |
| oasis-open | openc2-reactor-master         |    10 | master |
| oasis-open | openc2-reactor-relay          |    10 | master |
| oasis-open | openc2-oif-orchestrator       | 39646 | master |
| oasis-open | openc2-pub-sub-on-bsd         |    22 | master |
| oasis-open | csaf-documentation            | 25355 | master |
| oasis-open | cti-stix-slider               |   843 | master |
| oasis-open | csaf-parser                   |   277 | master |
| oasis-open | openc2-lycan-java             |   248 | master |
| oasis-open | openc2-lycan-python           |   135 | master |


#+NAME: oasisReposExclude
| cti-cybox3-json-schemas  |


** Oasis Open Repos

#+name: oasisRepos
#+begin_src emacs-lisp :var nrepos=60 :results replace vector value :exports code :noweb yes
(ghub-graphql
 (graphql-query ((organization
                  :arguments ((login . "oasis-open"))
                  (repositories
                   :arguments ((first . <<nrepos()>>)
                               (orderBy . ((field . UPDATED_AT)
                                           (direction . DESC))))
                   (edges
                    (node (owner login)
                          name
                          (defaultBranchRef prefix name)
                          url
                          updatedAt
                          isArchived)))))))
#+end_src


Filter the results, generate XML

#+name: oasisReposXML
#+begin_src emacs-lisp :var gqldata=oasisRepos repos-exclude=oasisReposExclude :results value html
(setq -gql-data gqldata)

;; no repos-core variable
;; (repos-core (flatten-list repos- core))

(let* ((repos-exclude (flatten-list repos-exclude)))
  (thread-first
    (thread-last
      (a-get* (nthcdr 0 gqldata) 'data 'organization 'repositories 'edges)
      (mapcar (lambda (el) (a-get* el 'node)))

      ;; filter archived repos
      (seq-filter (lambda (el) (not (a-get* el 'isArchived))))

      ;; filter repos in reposExclude list
      (seq-filter (lambda (el) (not (member (a-get* el 'name) repos-exclude))))
      (mapcar (lambda (el)
                (let* ((raw-name (a-get* el 'name))

                       ;; (repo-core? (member raw-name repos-core))

                       (path-dirs (list "oasis" raw-name))

                       ;; (path-dirs (cond (repo-core? (list "core" raw-name))
                       ;;                 (t (list "misc" raw-name))))

                       (path (string-join path-dirs "/"))
                       (ref (concat (a-get* el 'defaultBranchRef 'prefix)
                                    (a-get* el 'defaultBranchRef 'name)))
                       (name (string-join (list (a-get* el 'owner 'login)
                                                (a-get* el 'name)) "/")))
                  (concat "<project"
                          " name=\"" name
                          "\" path=\"" path
                          "\" revision=\"" ref "\" remote=\"github\"/>")))))
    (cl-sort 'string-lessp :key 'downcase)
    (string-join "\n")))
#+end_src

#+RESULTS: oasisReposXML
#+begin_export html
<project name="oasis-open/cacao-json-schemas" path="oasis/cacao-json-schemas" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/ces-specs" path="oasis/ces-specs" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/csaf-documentation" path="oasis/csaf-documentation" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/csaf-parser" path="oasis/csaf-parser" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-documentation" path="oasis/cti-documentation" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/cti-interop" path="oasis/cti-interop" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-pattern-matcher" path="oasis/cti-pattern-matcher" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-pattern-validator" path="oasis/cti-pattern-validator" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-python-stix2" path="oasis/cti-python-stix2" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-python-stix2-extensions" path="oasis/cti-python-stix2-extensions" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/cti-stix-common-objects" path="oasis/cti-stix-common-objects" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/cti-stix-elevator" path="oasis/cti-stix-elevator" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-stix-generator" path="oasis/cti-stix-generator" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/cti-stix-slider" path="oasis/cti-stix-slider" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-stix-validator" path="oasis/cti-stix-validator" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-stix-visualization" path="oasis/cti-stix-visualization" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-stix2-json-schemas" path="oasis/cti-stix2-json-schemas" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-taxii-client" path="oasis/cti-taxii-client" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-taxii-server" path="oasis/cti-taxii-server" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/cti-training" path="oasis/cti-training" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/dita-adoption-public" path="oasis/dita-adoption-public" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/dita-lightweight" path="oasis/dita-lightweight" revision="refs/heads/spec" remote="github"/>
<project name="oasis-open/dita-rng-converter" path="oasis/dita-rng-converter" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/dita-specializations" path="oasis/dita-specializations" revision="refs/heads/develop" remote="github"/>
<project name="oasis-open/dita-stylesheets" path="oasis/dita-stylesheets" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/emergency-emf" path="oasis/emergency-emf" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/legaldocml-akomantoso" path="oasis/legaldocml-akomantoso" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/legalruleml-repo" path="oasis/legalruleml-repo" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/mqtt-sn-sample-resources" path="oasis/mqtt-sn-sample-resources" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/odata-rapid" path="oasis/odata-rapid" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/Open-Repo-admin" path="oasis/Open-Repo-admin" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/openc2-compatibility" path="oasis/openc2-compatibility" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-custom-aps" path="oasis/openc2-custom-aps" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-iosacl-adapter" path="oasis/openc2-iosacl-adapter" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-jadn-software" path="oasis/openc2-jadn-software" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-lycan-beam" path="oasis/openc2-lycan-beam" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-lycan-elixir" path="oasis/openc2-lycan-elixir" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-lycan-java" path="oasis/openc2-lycan-java" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-lycan-python" path="oasis/openc2-lycan-python" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-ocas" path="oasis/openc2-ocas" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-oif-device" path="oasis/openc2-oif-device" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-oif-obo" path="oasis/openc2-oif-obo" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/openc2-oif-orchestrator" path="oasis/openc2-oif-orchestrator" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-orchid" path="oasis/openc2-orchid" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-pub-sub-on-bsd" path="oasis/openc2-pub-sub-on-bsd" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-reactor-master" path="oasis/openc2-reactor-master" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-reactor-relay" path="oasis/openc2-reactor-relay" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openc2-yuuki" path="oasis/openc2-yuuki" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/openeox" path="oasis/openeox" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/tab-documentation" path="oasis/tab-documentation" revision="refs/heads/master" remote="github"/>
<project name="oasis-open/tac-common-semantic-individuals" path="oasis/tac-common-semantic-individuals" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/tac-ontology" path="oasis/tac-ontology" revision="refs/heads/main" remote="github"/>
<project name="oasis-open/tosca-community-contributions" path="oasis/tosca-community-contributions" revision="refs/heads/master" remote="github"/>
#+end_export

** Generate XML

Generate =oasis.xml=

#+begin_src xml :tangle oasis.xml :noweb yes
<manifest>
  <<oasisReposXML()>>
</manifest>
#+end_src
